ADNdlc/STM32_CubeIDE/H743/0-8_example_project_v2/BSP/BSP_init.c
/*
 * BSP_init.c
 *
 *  Created on: Feb 7,2026
 *      Author: 12114
 */
#include "Project_cfg.h"
#include "dev_map_config.h"
#if (TARGET_PLATFORM == PLATFORM_STM32)
#include "stm32_mem.h"
#define platform_sys_mem_create()                                              \
  stm32_sys_mem_create() // sys无工厂，简单使用宏来绑定
#endif                   // TARGET_PLATFORM
#include "MemPool.h"
#include "Sys.h"
#include "dev_map.h"
#include "elog_init.h"
#include "humiture_factory.h"
#include "lvgl.h"
#include "lvgl/porting/lv_port_disp.h"
#include "lvgl/porting/lv_port_indev.h"
#include "sdram_factory.h"
#include "service_factory.h"
#include "timer_factory.h"
#include "uart_queue.h"
#include "usart_factory.h"
#include "shell.h"

#include "lvgl_resource/lvgl_resource.h"

/* 全局设备句柄 */
uart_queue_t *g_debug_queue = NULL;

/* 调试串口队列用的缓冲区 */
static uint8_t debug_tx_buf[4096];
static uint8_t debug_rx_buf[64];

/* LVGL相关 */
#if LVGL_ENABLE
lcd_driver_t *lcd = NULL;
static void lv_tick_cb(void *ctx) {
  lv_tick_inc(1);
} // 供 Timer 回调使用的 LVGL 心跳
#endif

/**
 * @brief 系统复位命令
 * 
 * 执行系统软复位，等同于按下复位按钮
 */
static int bsp_reset_cmd(int argc, char *argv[]) {
    log_i("System reset initiated...");
    HAL_NVIC_SystemReset();
    // 不会执行到这里，因为系统已经复位
    return 0;
}

void bsp_init(void) {
#ifndef platform_sys_mem_create
#error "bsp_init: 未定义有效的目标平台，请检查TARGET_PLATFORM配置"
#endif
  SysMem *mem_temp = NULL;
  mem_temp = platform_sys_mem_create();
  sys_mem_init(mem_temp); // 内存池功能初始化
  /* 系统层初始化 */
  sys_init();
  sys_mem_init_internal();

  /* 1. 创建硬件抽象层串口对象 */
  usart_driver_t *g_debug_uart = usart_driver_get(USART_ID_DEBUG);
  /* 2. 创建并初始化日志串口队列 */
  if (g_debug_uart) {
    g_debug_queue =
        uart_queue_create(g_debug_uart, debug_tx_buf, sizeof(debug_tx_buf),
                          debug_rx_buf, sizeof(debug_rx_buf));
    if (g_debug_queue) {
      uart_queue_set_wait_config(g_debug_queue, 2, 50); // 2ms等待, 最多50次
      uart_queue_set_auto_wait(g_debug_queue, true);
      uart_queue_start_receive(g_debug_queue); // 开启异步接收
    }
  }


  /* 3. elog初始化 */
  if (elog_init_and_config() == ELOG_NO_ERR) {

	elog_set_filter_lvl(5); // ELOG_LVL_WARN

    log_i("log init success.");
    log_a("log lvel: %d", ELOG_LVL_TOTAL_NUM);
    log_i("sys CoreClock: %d MHz", sys_get_CoreClock());
  } else {
    elog_deinit();
  }



  /* ---- 外部sdram和内存池初始化,注意顺序 ---- */
  sdram_driver_t *driver = sdram_driver_get(SDRAM_MAIN); // 获取SDRAM驱动
  if (driver == NULL) {
    log_e("Failed to get SDRAM driver instance");
    while (1) {
    }
  }
  if (SDRAM_INIT(driver) != 0) { // SDRAM初始化
    log_e("Failed to initialize SDRAM device");
    while (1) {
    }
  }
  sys_mem_init_external(); // 外部内存池初始化

#if SERVICE_ENABLE
  service_factory_init(); // 初始化服务组件的底层驱动
#endif

  /* ---- LVGL 初始化 ---- */
#if LVGL_ENABLE
  lv_init();
  lv_port_disp_init();
  lv_port_indev_init();
  log_i("LVGL core init success.");

  /* ---- 定时器任务(LVGL时基) ---- */
  timer_driver_t *timer_lv = timer_driver_get(TIMER_ID_LV);
  if (timer_lv) {
    TIMER_SET_PERIOD(timer_lv, 1);
    TIMER_SET_CALLBACK(timer_lv, lv_tick_cb, NULL);
    TIMER_START(timer_lv);
    log_i("LVGL timer tick starte(1ms).");
  } else {
    log_e("LVGL timer tick init failed!");
  }
#endif

  res_init();  // 初始化资源管理及处理烧录/显示测试
}

void bsp_process(void) {
#if LVGL_ENABLE
  lv_timer_handler(); // ui处理
#endif
#if SERVICE_ENABLE
  service_factory_process(); // 服务组件的底层处理
#endif
}

// 导出 elog 控制命令
SHELL_EXPORT_CMD(SHELL_CMD_PERMISSION(0) | SHELL_CMD_TYPE(SHELL_TYPE_CMD_FUNC),
                 log_out, elog_set_output_enabled,
                 enable / disable elog output);
SHELL_EXPORT_CMD(SHELL_CMD_PERMISSION(0) | SHELL_CMD_TYPE(SHELL_TYPE_CMD_FUNC),
                 log_lvl, elog_set_filter_lvl, set elog filter level);

// 导出系统复位命令
SHELL_EXPORT_CMD(SHELL_CMD_PERMISSION(0) | SHELL_CMD_TYPE(SHELL_TYPE_CMD_MAIN),
                 reset, bsp_reset_cmd, perform system reset);
